twitter-api/app/controllers/application_controller.rb

    def verify_authentication
      user = authenticate_with_http_token do |token, options|
        User.find_by(api_token: token)
---
SELECT  "users".* FROM "users" WHERE "users"."api_token" = $1 LIMIT $2  [["api_token", "zMzYPptp2jcsX4GSBGLdbi26"], ["LIMIT", 1]]