twitter-api/app/controllers/api/v1/posts_controller.rb

INSERT INTO "posts" ("body", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["body", "test post"], ["user_id", 5], ["created_at", "2018-06-02 13:16:14.856063"], ["updated_at", "2018-06-02 13:16:14.856063"]]
---
  def create
    @post = Post.new(post_params)

    if @post.save